Revit 2027 API
BuiltInFailures.WallFailures.ShorterThanMinWallFailure Property
 Wall is shorter than minimum height allowed by its type.\nIt is [Length] and must be at least [Length].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ShorterThanMinWallFailure { get; }
Public Shared ReadOnly Property ShorterThanMinWallFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ShorterThanMinWallFailure {
	FailureDefinitionId^ get ();
}
static member ShorterThanMinWallFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace